src/InformationRegisters/ИдентификаторыБазыЗнанийConfluence.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ИдентификаторыБазыЗнанийConfluence</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДанныхConfluence</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСсылки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>БазаЗнаний</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БазыЗнанийConfluence</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Элемент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектыИнтеграцииConfluence</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИдентификаторыБазыЗнанийConfluence/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаписатьИдентификатор(знач БазаЗнанийСсылка, знач Объект, знач Тип, знач Идентификатор, знач Версия,
	знач АдресСсылки = "",
	знач Представление = "",
	знач ДатаОбновления = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗаписьРегистра = РегистрыСведений.ИдентификаторыБазыЗнанийConfluence.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Элемент			= Объект;
	ЗаписьРегистра.БазаЗнаний		= БазаЗнанийСсылка;
	ЗаписьРегистра.ТипДанных		= Тип;
	ЗаписьРегистра.Идентификатор	= Идентификатор;
	ЗаписьРегистра.НомерВерсии		= Версия;
	ЗаписьРегистра.АдресСсылки		= АдресСсылки;
	ЗаписьРегистра.Представление	= Представление;
	ЗаписьРегистра.ДатаОбновления	= ?(НЕ ТипЗнч(ДатаОбновления) = Тип("Дата"), ТекущаяДатаСеанса(), ДатаОбновления);
	ЗаписьРегистра.Записать(Истина);
	
КонецПроцедуры

Функция ПолучитьИдентификаторВерсию(знач БазаЗнанийСсылка, знач Объект) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Элемент"		, Объект);
	Запрос.УстановитьПараметр("БазаЗнаний"	, БазаЗнанийСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИдентификаторыБазыЗнанийConfluence.Идентификатор КАК Идентификатор,
	|	ИдентификаторыБазыЗнанийConfluence.НомерВерсии КАК НомерВерсии
	|ИЗ
	|	РегистрСведений.ИдентификаторыБазыЗнанийConfluence КАК ИдентификаторыБазыЗнанийConfluence
	|ГДЕ
	|	ИдентификаторыБазыЗнанийConfluence.Элемент = &Элемент
	|	И ИдентификаторыБазыЗнанийConfluence.БазаЗнаний = &БазаЗнаний";
	
	ДанныеЗаполнения = Новый Структура("Идентификатор, НомерВерсии", "", 0);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		ЗаполнитьЗначенияСвойств(ДанныеЗаполнения, Выборка);
	КонецЕсли;	

	Возврат ДанныеЗаполнения;	
КонецФункции

Функция ПолучитьСсылкиНаОбъекты(знач БазаЗнанийСсылка, знач МассивОбъектов) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("БазаЗнаний"		, БазаЗнанийСсылка);
	Запрос.УстановитьПараметр("МассивОбъектов"	, МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИдентификаторыБазыЗнанийConfluence.Элемент КАК Элемент,
	|	ИдентификаторыБазыЗнанийConfluence.АдресСсылки КАК АдресСсылки
	|ИЗ
	|	РегистрСведений.ИдентификаторыБазыЗнанийConfluence КАК ИдентификаторыБазыЗнанийConfluence
	|ГДЕ
	|	ИдентификаторыБазыЗнанийConfluence.БазаЗнаний = &БазаЗнаний
	|	И ИдентификаторыБазыЗнанийConfluence.Элемент В(&МассивОбъектов)";
	
	Соответствие = Новый Соответствие; 
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Соответствие.Вставить(Выборка.Элемент, Выборка.АдресСсылки);
	КонецЦикла;  
	
	Возврат Соответствие;
КонецФункции

Функция ПолучитьСсылкуНаОбъект(знач БазаЗнанийСсылка, знач Объект) Экспорт
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Объект);
	
	Результат = ПолучитьСсылкиНаОбъекты(БазаЗнанийСсылка, МассивОбъектов);
	
	АдресСсылки = Результат.Получить(Объект);
	Возврат ?(АдресСсылки = Неопределено, "", АдресСсылки);
КонецФункции

#КонецОбласти

#КонецЕсли
